Autodesk.Revit.DB.ExternalResourceMatchOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceMatchOptions.ResourceType
The desired resource type which external resources should match.
Since:
2015

Autodesk.Revit.DB.ExternalResourceMatchOptions.#ctor(Autodesk.Revit.DB.ExternalResourceType)
Constructs new instance with specified resource type.
resourceType:
The desired resource type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceMatchOptions
Represents match options used to filter external resources when listing them from external resource server.
Since:
2015